//elements
const text = document.querySelector('#text');

const share = document.querySelector('#share');
const generate = document.querySelector('#generate');
const copy = document.querySelector('#copy');

//variables
const jokes = `Забавно, что Залдостанов грезит СССР, в котором нигде не работающий чувак на американском байке, и разодетый как пугало, сидел бы в тюрьме.
Обычная награда за хорошо выполненную работу - это еще больше работы.
В выражении "есть одно но" - два но, а в выражении "есть два но" - одно но.
Секретарша должна знать и хорошо выполнять три команды: "сидеть", "лежать" и "факс".
Интересно, а в женских раздевалках ходит вредный дед-уборщик, который на шарахающихся от него обнаженных девиц отвечает: "Ой, да что я там не видел?".
Завтра состоиться выставка домашних животных.Просьба выставить всех животных из дома в течение 24 часов.
"Наконец-то посадил дерево" - подумал прокурор когда закрылась решетка за Буратино.
Иногда смотришь на человека, и напрашивается вопрос: он родился таким придурком или курсы какие-то дополнительные закончил?
- У кого-то симпатичные ямки на щеках, у кого-то сексуальная родинка над губой, а у меня умопомрачительные мешки под глазами!
Мечтаю работать в секс-шопе! Только там вопрос всем клиентам: за каким х#ем Вы сюда пришли? - звучит вполне уместно.
- Коко Шанель заявила, что нужно мазать духами то место, куда вы хотите, чтобы вас целовали. Ой, вы бы знали, как мне там жгло...
- Видно, сдох у жены интернет! - сказал муж, чуя запах котлет!
Утро. Я в постели. Никто не мешает спать, ходят тихо, на цыпочках. С кухни вкусно пахнет... Это сон? Нет, я приехал домой! К родителям!
- Соседи жалуются, что мы по ночам пылесос включаем. А это не пылесос, это жена со мной беседует!
Одни философски смотрят на вещи, другие - на их отсутствие.
Кабаева Путину:- Володя, а давай уже распишемся.- А чем тебе сейчас плохо?- Надоело, как дуре в депутатах. Хочу быть первым вице-президентом...
Не знаю, кто там в английской разведке начальник и сколько он получает, но миллиардер Березовский работает там простым агентом.
Главная проблема русского народа - это то, что принято гордиться Гагариным, а не Королевым.
Специалист, отвечающий за безопасность атомной станции, сказал "пиз*ец" из-за вытекшей в кармане ручки. Но 15 человек все рано поседели.
- Мы с тобой одной крови, ты и я, - сказал комар блохе, сидящей на Маугли.
Хорошо, что я родился человеком, а не БАБОЙ!
Когда я вижу лозунг "Одно из двух: или пей или садись за руль", я всегда вспоминаю, что машины-то у меня нет.
Простым камнем можно подбить женщине глаз. Драгоценным - сердце. Но старые умные люди говорят, что лучше все-таки глаз.
- Мой муж, наверное, мусульманин. Я прихожу домой в шесть утра, а он мне - неверная, неверная.
- Вот скажи, если муж чистит ногти отверткой, можно назвать его дебилом?- Ну, если только отвертка крестовая...- Во! Еще один!
В связи с блокадой угля из ЛДНР хохлы решили отапливаться снарядами.
Последний удар задержанным оппозиционерам нанес адвокат Марк Фейгин, вызвавшись защищать их в суде.
У русских есть такая традиция: каждые 100 лет в 17 году выходить сперва весной просто прогуляться, а потом осенью - как получится.
Удивительно, но арест 1300 человек по всей Беларуси так и не остановил рекордное падение ВВП и не запустил заводы. Очень странно.
В Москве на несанкционированном митинге задержано около 6 миллионов евро.
Как говорит жена президента Азербайджана Мехрибан Ариф гызы Алиева:"Господин назначил меня любимым вице-президентом"...
- Хотите как на Украине? - спросил Батька вышедших на белорусский майдан.- Да! - ответили они.- Хорошо! - ответил Батька и повысил им ЖКХ в 10 раз.
В городах России прошли антикоррупционные митинги. Главный их лозунг - чиновники, поделитесь взятками!
По-моему зря смеются над веганами, под шашлык с водкой любое веганское блюдо идет на ура...
Украина будет демилитаризирована, распилена и продана по кускам. Это я про крейсер, если что.
В конкурсе на самую большую задницу, проходившем в Бразилии, уверенную победу одержала экономика России.
В первый раз все секса боятся. Я вообще спрятался в шкафу и орал: "Уйди сука голая!".
После президентских выборов в США российские хакеры уже не могли остановиться - Дональда Трампа избрали генсеком ООН, командором Мальтийского Ордена и Папой Римским.
Навальный посадил больше оппозиционеров с 2011 года, чем Путин за 17 лет.
Женщина есть женщина: организм сложный, механизм неуправляемый, действия непредсказуемые...
Британские учёные успешно разработали и испытали на мышах средство от старости: ни одна мышь до старости не дожила.
- Ваня, прекрати жрать говно!- А по первому каналу сказали, что это вкусно!
Британские ученые доказали, что яйцо появилось позже курицы, при этом не уточнили, левое или правое.
Строить стадионы для сборной России - всё равно что строить спальню, где у тебя на глазах будут иметь твою жену.
Сотни человек по России задержаны за участие в том, чего по мнению федеральных СМИ, вообще не происходило.
Указывая на другого пальцем, помни, что при этом три других твоих пальца указывают обратно на тебя.
Говорят, всем задержаным на митингах против коррупции дадут по 15 суток обязательных работ на тосканских виноградниках Дмитрия Медведева...
Жила-была девушка, очень рассеянная и забывчивая. Она часто путала противозачатачное и успокаительное. Теперь у нее девять детей, но ее это мало волнует.
Только наши парни, как настоящие джентльмены, могут открыть перед девушкой дверь и сказать: "давай реще".
Однажды я купила себе большой букет цветов. Придут, думаю, подруги, спросят - откуда, а я загадочно улыбнусь. Приходит подруга: "О! Цветов себе купила?".
- Ты такую, как я, больше не найдешь.- Я такую, как ты, больше искать не буду.
Демократия - это когда кучка мерзавцев управляет толпой дураков.
Куплю запчасти к "Жигулям" первой модели, или продам "Жигули" первой модели на запчасти.
Из доклада о русских хакерах следует, что раз время хакерских атак совпадает с временем рабочего дня в России - это точно русские.В наших подъездах тоже гадят ночью, когда все люди спят, а в Америке рабочий день.Неужели все-таки Обама?
У Кати не было фотоальбома, поэтому момент секса оттягивать было нечем.
Дорогой Виталик! Это пишет тебе Дедушка Мороз. Не могу прислать Лего. Ты не вложил в письмо своё согласие на обработку персональных данных.
Прежде, чем найдешь свою царевну, перецелуешь немало жаб!
Фира с Моней лежат на диване. Её телефон на кухне. Слышит, пришла эсэмэска. Встаёт, идёт... Видит, что сообщение от Мони. Читает: "Если ты таки встала, принеси, пожалуйста, пиво!".
Нырнув в воду, не спрашивай: виден ли зад?
Если Патриарх Кирилл верит в Бога, то почему он ездит в бронированном Мерседесе под охраной ФСО за счёт бюджета, а не надеется на заступничество своего небесного начальника?
Чужой человек, ставший родным - уже никогда не будет чужим; родной человек, ставший чужим - уже никогда не будет родным.
Кто-то умеет хорошо рисовать. Кто-то петь, кто-то танцевать. А я умею косячить на пустом месте. Все-таки талант есть в каждом из нас.
Карлсон не знал, как объяснить малышу, что намордник в спальне родителей еще не значит, что ему подарят собаку.
Кульминацией корпоратива стал торт, выскакивающий из стриптизерши.
Сергей зарабатывает в месяц 44 тысячи рублей. А его жена-домохозяйка тратит в месяц 80 тысяч. Вопрос: догадывается ли Сергей о существовании Антона?
Положительные эмоции - это эмоции, которые возникают, если на всё положить.
Купили доченьке веб-камеру, и теперь ровно одна треть комнаты идеально убрана.
Девушка, которая думает, что меняет парней как перчатки, просто еще не понимает, что "пошла по рукам"...
Мои друзья - полицейские служили в милиции, потом в полиции, теперь их переводят в национальную гвардию... Чувствую, на пенсию они уйдут мушкетерами.
Playboy вернет на обложку снимки полностью обнаженных девушек.Трамп на посту меньше месяца, а уже делает Америку великой снова.
Было на Свете семь великих чудес, а на восьмом она забеременела!
В ответ на заявление Трампа, что наплыв иммигрантов вызвал большие проблемы в Швеции, возмущённые шведы объявили ему джихад.
Специально для геймеров православная церковь выпустила крест. На обратной стороне которого надпись "Спасись и сохранись!".
Причуды модернизации в сельском хозяйстве. Деревенский пастух забирается на лошадь, потому что так выше, и сотовый телефон лучше берёт!
Цветы не самый практичный подарок на 8 Марта. Постоят пару дней, а дальше в мусорку. Другое дело свиная голова. Это и суп, и холодец, и просто красиво.
Те, кто хотят Сталина, хотят его не для себя, а для соседа...
На исповеди:- Батюшка, грешна я: чревоугодничала, пьянствовала, блудила...- Знаю, дочь моя.- Откуда?!- Подписан на твой инстаграм.
Мы все рождаемся мокрые, голые и голодные. И это только начало.
Если ночью муж назвал вас чужим именем - откликнитесь, не пожалеете!
Если человек не подаёт вам руки под предлогом того, что он только что вышел из сортира, просто поинтересуйтесь - как дела.
Трибуна стадиона, - единственное место, где бедные могут материть и смотреть на миллионеров свысока.
Сегодня в переходе станции метро Белорусская состоялась встреча выпускников, купивших здесь дипломы 5 лет назад.
Медведев утвердил индексацию социальных пенсий на 1,5%.Те пенсионеры, кто раньше еле сводил концы с концами на 8645 рублей, теперь будут шиковать на 8774.
Анекдоты должны быть как женское нижнее бельё - тонким, прозрачным и коротким.
Предлагаю вместо копии Рейхстага построить в России копии немецкой экономики, уровня жизни и качества производимых товаров и услуг.
Иногда смотришь на людей, к которым раньше испытывал симпатию, и невольно начинаешь сомневаться в своей адекватности.
- Эй, зачем ты пьешь эту грязную воду с озера, со всей деревни г@вносток сюда выходит!- Whаt did уou sау?- Я говорю: двумя руками черпай!
- Это у тебя что такое?- Челябинское мохито.- Ром и мята?- Нет, водка и укроп.
8 марта: пьяные бабы, перепачканные шоколадом, гуляют по улице, бьют флаконы духов об головы и пристают с вопросом: "А ты рожал, б%я?".
Девушки - самые добрые в мире существа, они могут простить любого парня, даже если он ни в чем не виноват.
Заболела! Насморк! Купила лекарство. Читаю: побочные эффекты - Сонливость, Боль в глазах, Шум в ушах, Нервозность, Бессонница, Судороги, Сухость во рту, Рвота, Депрессия, Гастрит, Диарея, Запор, Мигрень... Сижу и думаю - может фиг с ним, с насморком!
- Дайте пачку "Беломора".- Тебе нет 18-ти.- Черт... ну тогда колу 0.5 и шоколадку с фольгой.
Он:- Дорогая, я хочу ребенка...Она:- Давай сразу уточним. Сделать или вырастить?
Парень кричит под окнами:- Любимая, ты только моя!Вместо любимой выглядывает папа и кричит в ответ:- Молодой человек! Вашей она станет тогда, когда будете оплачивать ее телефонные разговоры, учебу, одежду, еду и интернет! А пока она моя!
Сегодня утром услышал по телевизору, эксперт по фэн-шую вещал: "Если вы в своем беспорядке знаете, где что лежит, то это уже не беспорядок, а ваш личный порядок".
Самого большого "леща" в день соревнований по подледному лову рыбы поймала жена рыбака Петрова, которая не разбудила его утром.
В любой вещи на свете есть изъян. В Ламборджини, например, тяжело педали валенками нажимать.
Смотрю новости из Сирии и представляю: февраль 1943 года, Сталинград, Красная армия предоставляет гуманитарный коридор войскам фельдмаршала Паулюса.
Новости юриспруденции.Наличие доказательств невиновности обвиняемого является отягчающим обстоятельством.
В тюрьмах сидят те, кто не умеет воровать, а в креслах - наоборот.
Вы злые, потому что слабые. Добрым быть всегда сложнее.
Путин вспомнил, как его, месячного ребенка, крестил отец патриарха Кирилла.А патриарх Кирилл вспомнил, что ему рекомендацию для вступления в КПСС давал отец Путина.
Развелись через месяц - потому что их коты не сошлись характерами.
Заказчик сказал, что мое предложение самое выгодное. Не спал всю ночь. Думал где обсчитался.
- Не понимаю, если ректоры и студенты 23 питерских вузов полностью за передачу городских объектов РПЦ, то почему вместо собора не передать именно эти 23 вуза? И студентов заодно.- Все впереди, коллега. Все впереди.
Через пару лет можно будет нассать на экран айфона, и он скажет беременна ли ты.
Пора ввести налог на бездомных, а то поживают себе спокойненько в теплотрассах и за капремонт не платят.
РПЦ: Хотим забрать Херсонес!Севастопольцы: Херсонес большой, будем отдавать по частям. В этом году получите Хер.
В моём понимании Тандем - это когда двое педали крутят. А вот если второй едет пассажиром, при этом постоянно тормозит и сыплет смешными репризами, это называется Цирк.
Есть подтверждение, что Трамп не гей!Элтон Джон отказался с ним встречаться.
В 2015 цены росли из-за падения цен на нефть и слабеющего рубля.в 2016 из-за достижения дна падения.И наконец в 2017 цены будут расти из-за укрепления курса рубля.
Законы - это паутина: крупные мухи сквозь неё прорываются, а мелкие - застревают.
Если Путин на самом деле повлиял на выборы в США, то он всесилен. Если нет, то ЦРУ и ФБР нагло врут. Какая-то патовая ситуация для либералов.
Скажи мне, кто твой друг и хули вы припёрлись.
Медведев об аресте Улюкаева: это находится за гранью моего понимания.Эх, Дмитрий Анатольевич, если бы только это.
Одно из самых удивительных заблуждений - что счастье человека в том, чтобы ничего не делать.
Купил елку 31 декабря. Могу ли я в соответствии с законом о Защите потребителей в срок до 13 января вернуть елку как не подошедшую?
Карлсон - первая попытка применения дронов в педагогике.`.split('\n');

//init
(() => {
    share.addEventListener('click', async () => {
        if (navigator.share) {
            await navigator.share({
                title: 'Весёлый анекдот',
                text: text.innerHTML
            });
        } else {
            window.alert('Не удалось отправить. Сервис отправки не доступен на данный момент.');
        };
    });

    generate.addEventListener('click', () => {
        const joke = jokes[Math.floor(Math.random() * jokes.length)];

        text.innerHTML = joke.trim();
    });

    copy.addEventListener('click', async () => {
        if (navigator.clipboard) {
            await navigator.clipboard.writeText(text.innerHTML);
        } else {
            window.alert('Не удалось скопировать. Сервис буфера обмена не доступен на данный момент.');
        };
    });
})();
